---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ImportFailures
source: html/f5cf592a-a850-831d-dcd3-9c81b8084a53.htm
---
# BuiltInFailures.ImportFailures Properties

The original model contains unsupported geometric data such as curves or points.